/**********************BST-V51实验开发板例程************************
*  平台：BST-M51 + Keil U4 + STC89C52
*  名称：红外发送模块实验
*  公司：深圳市亚博软件开发有限公司      
*  日期：2015-6
*  晶振:11.0592MHZ
*  说明：免费开源，不提供源代码分析.
******************************************************************/
#include <reg52.h>

#define uchar unsigned char
#define uint unsigned int 

sbit k1 = P3^4;//定义四个独立按键
sbit k2 = P3^5;
sbit k3 = P3^6;
sbit k4 = P3^7;
sbit out=P1^5;//发送IO口

const uchar TabHL1[12]={0x30,0x18,0x7a,0x10,0x38,0x5a,0x42,0x4a,
						0x52,0x00,0xff,0xa6};//数据码码表1-9&2字节用户码
/*------------------------------------------------
                  延时函数
------------------------------------------------*/
void delay(uint xms)				
{
	uint i,j;
	for(i=xms;i>0;i--)		      //i=xms即延时约xms毫秒
		for(j=112;j>0;j--);
}

void delay560us(void)	//560us延迟函数			
{
	uint j;
	for(j=63;j>0;j--);
}

void delay4500us(void)	   //4.5ms延迟函数	
{
  	uint j;
	for(j=516;j>0;j--);
}

void khz_2(uint num)		 //38KHZ脉冲 占空比1:2
{
    for(;num>0;num--)
	 {
//	  _nop_();
	  out=~out;	    
	 }
} 

/*------------------------------------------------
                  发送逻辑0
------------------------------------------------*/
void send0(void)
{  
   khz_2(42) ;
   //khz_3(21) ;
   out=1;
   delay560us();
}
/*------------------------------------------------
                  发送逻辑1
------------------------------------------------*/
void send1(void)
{  
   khz_2(42) ;
   //khz_3(21) ;
   out=1;
   delay560us();
   delay560us();
   delay560us();
}
/*------------------------------------------------
                发送一字节数据
------------------------------------------------*/
void Send8Bit(uchar dat)
{
    if(dat&0x80){	send1();}
	else{		send0();}
	if(dat&0x40){	send1();}
	else{		send0();}
	if(dat&0x20){	send1();}
	else{		send0();}
	if(dat&0x10){	send1();}
	else{		send0();}
	if(dat&0x08){	send1();}
	else{		send0();}
	if(dat&0x04){	send1();}
	else{		send0();}
	if(dat&0x02){	send1();}
	else{		send0();}
	if(dat&0x01){	send1();}
	else{		send0();}

}

/*------------------------------------------------
                 发送用户码
------------------------------------------------*/
void usercode()	  //发送用户码 00FF
{
     Send8Bit(TabHL1[9]);
	 Send8Bit(TabHL1[10]);
}
/*------------------------------------------------
                 发送引导码
------------------------------------------------*/
void leadcode(void)	//发送引导码
{
     khz_2(690) ;
	 //khz_3(345) ;
	 out=1;
   	 delay4500us();

}
/*------------------------------------------------
                 发送红外值
------------------------------------------------*/
void send_1()	//00110000 		发送”1“的信号
 {
     leadcode();
     usercode();
     Send8Bit(TabHL1[0]);
	 Send8Bit(~TabHL1[0]);
 }

 void send_2()	//00011000	   发送”2“的信号
 {
     leadcode();
     usercode();
	 Send8Bit(TabHL1[1]);
	 Send8Bit(~TabHL1[1]);
 }

 void send_3()	//01111010	   发送”3“的信号
 {
     leadcode();
     usercode();
	 Send8Bit(TabHL1[2]);
	 Send8Bit(~TabHL1[2]);
 }

 void send_4()	//00010000	  发送”4“的信号
 {
     leadcode();
     usercode();
	 Send8Bit(TabHL1[3]);
	 Send8Bit(~TabHL1[3]);
 }

/*------------------------------------------------
                 按键扫描函数
------------------------------------------------*/
void keyscan()
{
	while(1)
	{
		if(k1 == 0)//判断是否有按下按键的信号
		{
			delay(10);//延时10ms 消抖
			if(k1 == 0)//再次判断按键是否被按下
			{
				while(k1 == 0);//直到按键判断松开
				send_1();//松开后执行程序 发送”1“的信号
			}
		}
		if(k2 == 0)//判断是否有按下按键的信号
		{
			delay(10);//延时10ms 消抖
			if(k2 == 0)//再次判断按键是否被按下
			{
				while(k2 == 0);//直到按键判断松开
				send_2();//松开后执行程序 发送”2“的信号
			}
		}
		if(k3 == 0)//判断是否有按下按键的信号
		{
			delay(10);//延时10ms 消抖
			if(k3 == 0)//再次判断按键是否被按下
			{
				while(k3 == 0);//直到按键判断松开
				send_3();//松开后执行程序 发送”3“的信号
			}
		}
		if(k4 == 0)//判断是否有按下按键的信号
		{
			delay(10);//延时10ms 消抖
			if(k4 == 0)//再次判断按键是否被按下
			{
				while(k4 == 0);//直到按键判断松开
				send_4();//松开后执行程序 发送”4“的信号
			}
		}
	}
}	

/*------------------------------------------------
                    主函数
------------------------------------------------*/
void main(void)
{
   while(1)
   {
       keyscan();
   }
}