/*********************************************************************
 *
 *                          bstv51.h
 *
 *********************************************************************
 * 文件名: delay.h
 * 描  述: 延时函数
 ********************************************************************/

/*变量类型标识的宏定义,通常做法*/
#define uchar unsigned char //8 0-255
#define uint unsigned int   //16  0-65535

void delay(uint xms);

void delay(uint xms)				
{
	uint i,j;
	for(i=xms;i>0;i--)		      //i=xms即延时约xms毫秒
		for(j=112;j>0;j--);
}