/*************************************************
*实验名：定时器实验
*实验效果：第一个led灯以500ms一次的精确频率闪烁
*************************************************/
#include<reg52.h>

sbit led = P1^0;
int i = 0;

void timer1_init()
{
	TMOD = 0x10; //定时器0选择工作方式1
    TH1 = 0x4C;	 //设置初始值，定时50ms
    TL1 = 0x00; 
    EA = 1;			 //打开总中断
    ET1 = 1;		 //打开定时器0中断
    TR1 = 1;		 //启动定时器0
}

void main()
{
	led = 1;
	timer1_init();//定时器1的初始化
	while(1)
	{
		if(i==10)
		{
		  led = ~led;
		  i = 0; //注意i需要零
		}
	}


}

void timer1() interrupt 3
{
    TH1 = 0x4C;	 //设置初始值，定时50ms
    TL1 = 0x00;
	i++;
}