/**********************BST-M51ÊµÑé¿ª·¢°åÀı³Ì************************
*  Æ½Ì¨£ºBST-M51 + Keil U4 + STC89C52
*  Ãû³Æ£º24L01ÎŞÏß½ÓÊÕ£¨´Ó»ú0£©
*  ¹«Ë¾£ºÉîÛÚÊĞÑÇ²©Èí¼ş¿ª·¢ÓĞÏŞ¹«Ë¾       
*  ÈÕÆÚ£º2015-6
*  ¾§Õñ:11.0592MHZ
******************************************************************/
#include<reg52.h>
#include"NRF24L01.h"  
#include"Delay.h"

sbit led = P1^1 ;

void main()
{

   unsigned int num=0 ;   
   led = 1; 

   NRF24L01Int();  
   uart_init();   
  
   
   while(1)
    {  	   
	   NRFSetRXMode();   //ÉèÖÃÎª½ÓÊÕÄ£Ê½  
	   GetDate();        //¿ªÊ¼½ÓÊÕÊı¾İ £¬ÊµÊ±½ÓÊ
 	
	}	
}